//リスト化、変数定義、数の抽出
var りほたんリスト = ["りほたん１","りほたん2","りほたん3"];
var 人数 = 0;
for (i = 0; i < りほたんリスト.length; i++) {
人数 = 人数 + 1;
  }
console.log(人数);

//変数設定、増加
var りほたん = 19;
りほたん++;
りほたん++;
りほたん++;
console.log(りほたん);

//変数設定、減少
var りほたん = 19;
りほたん--;
りほたん--;
りほたん--;
console.log(りほたん);

//変数設定、属性付与
var りほたん = {性別:"女",年齢:19,種族:"人間",職業:"JD"};
りほたん.種族 = "天使"
りほたん.趣味 = "パンチラ"
console.log(りほたん);



//if文、算出
var りほたんリスト = ["りほたん1","りほたん2","りほたん3"];
var 人数 = 0;

for ( i = 0; i < りほたんリスト.length; i++) {
  if ( i == 0) {
    人数++;
  } else {
    人数--;
  }
}

console.log(人数);

//if文　console memo
var りほたんリスト = ["りほたん1","りほたん2","りほたん3"];
var 人数 = 0;

for ( i = 0; i < りほたんリスト.length; i++) {
  console.log( i + "週目のループ開始");
  if ( i == 1 ) {
     人数++;
  } else {
     人数--;
  }
}

console.log(人数)

//
